knowledge-maps-api/app/controllers/knowledge_maps_controller.rb

  def index
    @knowledge_maps = KnowledgeMap.all
---
SELECT "knowledge_maps".* FROM "knowledge_maps"

  def set_knowledge_map
    @knowledge_map = KnowledgeMap.find(params[:id])
---
SELECT  "knowledge_maps".* FROM "knowledge_maps" WHERE "knowledge_maps"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]